case_directories/case_sF/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/air";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];
#include    "include/ABLConditions"

internalField    uniform (0.0 0.0 0.0);

boundaryField
{
    #include    "include/ABLConditions"
    inlet
    {
        type            atmBoundaryLayerInletVelocity;
        #include        "include/ABLConditions"
        value           uniform $flowVelocity;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        #include        "include/ABLConditions"
        value           uniform $flowVelocity;
    }
    top
    {
        type            slip;
    }
    terrain
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    vegetation
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    side1
    {
        type            slip;
    }
    side2
    {
        type            slip;
    }
    buildings
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}