case_directories/case_sF/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

#include        "include/ABLConditions"

internalField   uniform $epsilonInlet;

boundaryField
{
    #include        "include/ABLConditions"

    inlet
    {
        type            atmBoundaryLayerInletEpsilon;
        flowDir         $flowDir;
        zDir            $zDir;
        Zref            $Zref;
        Uref            $Uref;
        zGround         $zGround;
        z0              $z0;
        d               uniform 0.0;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            slip;
    }
    terrain
    {
        type            epsilonz0WallFunction;
        z0              $z0;
        value           $internalField;
    }
    vegetation
    {
        type            epsilonz0WallFunction;
        z0              $z0;
        value           $internalField;
    }
    side1
    {
        type            slip;
    }
    side2
    {
        type            slip;
    }
    buildings
    {
        type            epsilonWallFunction;
        value           uniform $epsilonInlet;
    }
}


// ************************************************************************* //
