case_directories/case_sF/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.1;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
	    nSweeps		1;
    }

    k
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;
        nSweeps          1;
    }

    epsilon
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;
        nSweeps          1;
    }

    Phi
    {
        $p;
    }
}

SIMPLE
{
    residualControl

    {
        p               1e-6;
        U               1e-6;
        "(k|omega|epsilon)" 1e-6;
    }
    nNonOrthogonalCorrectors 2; // Changed from 3 to 2
    consistent yes;
    pRefCell        0;
    pRefValue       0;

}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
    fields
    {
        p               0.9;
    }
    equations
    {
        U               0.9;
        "(k|omega|epsilon).*" 0.9;
        //         U               0.7;
        // "(k|omega|epsilon).*" 0.7;
        //with simplec 0.9
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
